Revit 2026 API

# ScheduleFieldColumnHeading Property

---

The column heading text.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string ColumnHeading { get; set; }
```
```vb
Public Property ColumnHeading As String
	Get
	Set
```
```cpp
public:
property String^ ColumnHeading {
	String^ get ();
	void set (String^ value);
}
```
```fsharp
member ColumnHeading : string with get, set
```

#### Property Value

String The heading text.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | When setting this property: A non-optional argument was null |

On initial creation of a ScheduleField, the column heading is initialized based on the field name (typically a parameter name).

#### Reference

ScheduleField Class

Autodesk.Revit.DB Namespace